Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision Constructor
 Parameterized constructor.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Revision(
	int referenceModelId,
	int id,
	DateTime time,
	string hash,
	string fileName,
	bool isCurrentRevision
)
Public Sub New (
	referenceModelId As Integer,
	id As Integer,
	time As DateTime,
	hash As String,
	fileName As String,
	isCurrentRevision As Boolean
)
Parameters
referenceModelId
Type: System.Int32
[Missing <param name="referenceModelId"/> documentation for "M:Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)"]
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)"]
time
Type: System.DateTime
[Missing <param name="time"/> documentation for "M:Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)"]
hash
Type: System.String
[Missing <param name="hash"/> documentation for "M:Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)"]
fileName
Type: System.String
[Missing <param name="fileName"/> documentation for "M:Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)"]
isCurrentRevision
Type: System.Boolean
[Missing <param name="isCurrentRevision"/> documentation for "M:Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)"]
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace